app/Helpers/Custom_helper.php

  function dotBackground($item)
  {
    if (empty($item['source'])) {
      $sourceModel = new SourceModel();
      $item['source'] = $sourceModel->find($item['source_id'] ?? 0);
---
SELECT *
FROM `sources`
WHERE `sources`.`id` = '3'