app/Controllers/BaseController.php

SELECT `categories`.*, `category_translations`.`name` as `trans_name`
FROM `categories`
LEFT JOIN `category_translations` ON `category_translations`.`category_id` = `categories`.`id` AND `category_translations`.`language_id` = 5
WHERE `parent_id` IS NULL
---
    $this->language_id = $this->language['id'] ?? 0;

    $this->base_data['is_mobile'] = is_mobile($this->request);
    $this->base_data['categories'] = $this->categoryModel->select('categories.*, category_translations.name as trans_name')
      ->join('category_translations', "category_translations.category_id = categories.id AND category_translations.language_id = {$this->language_id}", 'left')
      ->where('parent_id', null)->findAll();

SELECT `locations`.*, `location_translations`.`name` as `trans_name`, COUNT(DISTINCT items.id) as item_count
FROM `locations`
LEFT JOIN `location_translations` ON `location_translations`.`location_id` = `locations`.`id` AND `location_translations`.`language_id` = 5
LEFT JOIN `items` ON `items`.`city_id` = `locations`.`id`
WHERE `locations`.`parent_id` = '6'
GROUP BY `locations`.`id`
ORDER BY `en_name` ASC
---
  private function getSidebarDataByLoc($country = null)
  {
    $sidebar_builder = $this->locationModel->select('locations.*, location_translations.name as trans_name, COUNT(DISTINCT items.id) as item_count')
      ->join('location_translations', "location_translations.location_id = locations.id AND location_translations.language_id = {$this->language_id}", 'left');

    if (!empty($country)) {
      $sidebar_title = trans('Cities');
      $sidebar_builder->join('items', 'items.city_id = locations.id', 'left')
        ->where('locations.parent_id', $country['id']);
    } else {
      $sidebar_title = trans('Countries');
      $sidebar_builder->join('items', 'items.country_id = locations.id', 'left')
        ->where('locations.parent_id', null);
    }

    $sidebar_list = $sidebar_builder->groupBy('locations.id')
      ->orderBy('en_name', 'ASC')
      ->findAll();

SELECT *
FROM `items`
WHERE `category_id` = '1'
AND `country_id` = '6'
AND `id` != '6'
ORDER BY `created_at` DESC
 LIMIT 3
---
  private function getRelateItemsByLoc($itemId = null, $loc = null)
  {
    $relate_items = [];
    foreach ($this->base_data['categories'] as $cat) {
      $relate_builder = $this->itemModel->where('category_id', $cat['id']);
      if (!empty($loc)) {
        if (empty($loc['parent_id'])) {
          $relate_builder->where('country_id', $loc['id']);
        } else {
          $relate_builder->where('city_id', $loc['id']);
        }
      }

      $cat_items = $relate_builder->where('id !=', $itemId)
        ->orderBy('created_at', 'DESC')
        ->findAll(3);