app/Controllers/Categories.php

  public function items($slug)
  {
    $page = (int) $this->request->getGet('page');
    if ($page == 1) {
      $currentUrl = current_url();
      $query = $_GET;
      unset($query['page']);
      $redirectUrl = $currentUrl . (empty($query) ? '' : '?' . http_build_query($query));

      return redirect()->to($redirectUrl, 301);
    }

    $cat = $this->categoryModel
      ->where('slug', $slug)
      ->first();
    if (!$cat) {
      return $this->responseError404();
      // throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
    }
    $cat['trans_name'] = $this->categoryTranslationModel->getTransName($cat, $this->language);

    $locSlug = esc($this->request->getGet('loc'));
    $loc = $this->locationModel
      ->where('slug', $locSlug)
      ->first();
---
SELECT *
FROM `categories`
WHERE `slug` = 'hotels'
 LIMIT 1
SELECT *
FROM `locations`
WHERE `slug` = 'united-states'
 LIMIT 1

        ->where('isc.sub_category_id', $cat['id']);
    }

    $sub_categories = $this->categoryModel->where('parent_id', $cat['parent_id'] ?? $cat['id'])
      ->select('categories.*, category_translations.name as trans_name')
      ->join('category_translations', 'category_translations.category_id = categories.id AND category_translations.language_id = ' . (int)$this->language_id, 'left')
      ->findAll();
---
SELECT `categories`.*, `category_translations`.`name` as `trans_name`
FROM `categories`
LEFT JOIN `category_translations` ON `category_translations`.`category_id` = `categories`.`id` AND `category_translations`.`language_id` = 5
WHERE `parent_id` = '1'