app/Controllers/Items.php

  public function show($categorySlug, $sourceSlug, $sourceId, $slug)
  {
    if (!is_bot($this->request) && !is_ip_rate_limited($this->request)) {
      if (rand(1, 100) <= 25) {
        $userAgent = $this->request->getUserAgent()->getAgentString();
        $url = current_url();
        $now = new \DateTime('now', new \DateTimeZone('Asia/Ho_Chi_Minh'));
        $logFile = WRITEPATH . 'logs/redirect-' . $now->format('Y-m') . '.log';
        $logLine = $now->format('Y-m-d H:i:s') . ' | ' . $this->request->getIPAddress() . ' | ' . $userAgent . ' | ' . $url . PHP_EOL;
        file_put_contents($logFile, $logLine, FILE_APPEND | LOCK_EX);
        return $this->book($categorySlug, $sourceSlug, $sourceId, $slug);
      }
    }

    // Tìm category_id theo tên
    $category = $this->categoryModel
      ->where('slug', $categorySlug)
      ->first();
    $source = $this->sourceModel
      ->where('slug', $sourceSlug)
      ->first();
---
SELECT *
FROM `categories`
WHERE `slug` = 'activities'
 LIMIT 1
SELECT *
FROM `sources`
WHERE `slug` = 'a'
 LIMIT 1

    $this->base_data['meta_hreflangs'] = array_intersect_key($this->base_data['meta_hreflangs'], array_flip(array_map(fn($lang) => $lang['code'], $this->base_data['languages'])));

    // Tìm item theo category_id, source_id và source_item_id
    $item = $this->itemModel
      ->where('category_id', $category['id'])
      ->where('source_id', $source['id'])
      ->where('source_item_id', $sourceId)
      ->first();
---
SELECT *
FROM `items`
WHERE `category_id` = '2'
AND `source_id` = '1'
AND `source_item_id` = '974645'
 LIMIT 1

  public function showImg($category_slug, $source_slug, $type, $source_id)
  {
    $cacheDir = WRITEPATH . "cache/{$type}/";
    $cacheTtl = ($type == 'thumb' ? 7 : 3) * 24 * 60 * 60; // 7 ngày
    $maxWidth = $type == 'thumb' ? 395 : 960;
    $maxHeigt = $type == 'thumb' ? 225 : 540;

    // Tạo thư mục cache nếu chưa có
    if (!is_dir($cacheDir)) {
      mkdir($cacheDir, 0755, true);
    }

    // Dọn cache cũ (1 lần mỗi 100 request để tiết kiệm tài nguyên)
    if (mt_rand(1, 100) === 1) {
      $this->cleanOldCache($cacheDir, $cacheTtl);
    }

    // Tìm category_id theo tên
    $category = $this->categoryModel
      ->where('slug', $category_slug)
      ->first();
    $source = $this->sourceModel
      ->where('slug', $source_slug)
      ->first();

    if (!$category || !$source) {
      return $this->sendLocalImage();
    }

    // Tìm item theo category_id, source_id và source_item_id
    $item = $this->itemModel
      ->where('category_id', $category['id'])
      ->where('source_id', $source['id'])
      ->where('source_item_id', $source_id)
      ->first();
---
SELECT *
FROM `categories`
WHERE `slug` = 'hotels'
 LIMIT 1
SELECT *
FROM `sources`
WHERE `slug` = 'c'
 LIMIT 1
SELECT *
FROM `items`
WHERE `category_id` = '1'
AND `source_id` = '3'
AND `source_item_id` = '8553XJ6QPQ260306'
 LIMIT 1

      }

      if (!empty($updateData)) {
        $this->itemModel->update($item['id'], $updateData);
      }
    }

    $country = $this->locationModel->find($item['country_id'] ?? 0);
---
UPDATE `items` SET `rating_count` = 478, `updated_at` = '2025-11-26 02:47:22'
WHERE `items`.`id` IN ('6')
SELECT *
FROM `locations`
WHERE `locations`.`id` = '7'