app/Controllers/Locations.php

  public function items($slug)
  {
    $page = (int) $this->request->getGet('page');
    if ($page == 1) {
      $currentUrl = current_url();
      $query = $_GET;
      unset($query['page']);
      $redirectUrl = $currentUrl . (empty($query) ? '' : '?' . http_build_query($query));

      return redirect()->to($redirectUrl, 301);
    }

    $loc = $this->locationModel
      ->where('slug', $slug)
      ->first();
    if (!$loc) {
      return $this->responseError404();
      // throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
    }
    $loc['trans_name'] = $this->locationTranslationModel->getTransName($loc, $this->language);

    $locSources = $this->locationSourceModel->select('location_sources.*, sources.name as source_name')
      ->join('sources', 'sources.id = location_sources.source_id', 'left')
      ->where('location_id', $loc['id'])
      ->findAll();
---
SELECT *
FROM `locations`
WHERE `slug` = 'united-states'
 LIMIT 1
SELECT `location_sources`.*, `sources`.`name` as `source_name`
FROM `location_sources`
LEFT JOIN `sources` ON `sources`.`id` = `location_sources`.`source_id`
WHERE `location_id` = '6'

      $builder = $this->itemModel
        ->where('city_id', $loc['id']);
    } else {
      $builder = $this->itemModel
        ->where('country_id', $loc['id']);
---
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `country_id` = '6'