app/Models/CategoryTranslationModel.php

SELECT `name`
FROM `category_translations`
WHERE `category_id` = '2'
AND `language_id` = '5'
---
  public function getTransName($category, $lang)
  {
    if ($lang) {
      return $this->select('name')
        ->where('category_id', $category['id'])
        ->where('language_id', $lang['id'])
        ->get()
        ->getRow('name');