app/Models/CategoryModel.php

  public function getSubCategories($itemId)
  {
    return $this->db->table('item_sub_categories isc')
      ->select('c.*, ct.name as trans_name')
      ->join('categories c', 'isc.sub_category_id = c.id')
      ->join('category_translations ct', 'ct.category_id = c.id AND ct.language_id = ' . (int)$this->language_id, 'left')
      ->where('isc.item_id', $itemId)
      ->get()
      ->getResultArray();
---
SELECT `c`.*, `ct`.`name` as `trans_name`
FROM `item_sub_categories` `isc`
JOIN `categories` `c` ON `isc`.`sub_category_id` = `c`.`id`
LEFT JOIN `category_translations` `ct` ON `ct`.`category_id` = `c`.`id` AND `ct`.`language_id` = 0
WHERE `isc`.`item_id` = '6'