app/Models/ItemModel.php

SELECT *
FROM `categories`
WHERE `categories`.`id` = '2'
SELECT *
FROM `sources`
WHERE `sources`.`id` = '1'
---
  public function updateBaseData(&$item)
  {
    if (empty($item['category'])) {
      $categoryModel = new CategoryModel();
      $item['category'] = $categoryModel->find($item['category_id'] ?? 0);
    }

    if (empty($item['source'])) {
      $sourceModel = new SourceModel();
      $item['source'] = $sourceModel->find($item['source_id'] ?? 0);