app/Models/LanguageModel.php

    public function getActiveList()
    {
        return $this->where('active', 1)
        ->orderBy('code', 'ASC')
        ->findAll();
---
SELECT *
FROM `languages`
WHERE `active` = 1
ORDER BY `code` ASC