app/Models/LocationTranslationModel.php

SELECT `name`
FROM `location_translations`
WHERE `location_id` = '6'
AND `language_id` = '5'
---
	public function getTransName($location, $lang)
	{
		if ($lang['locale'] != config('App')->defaultLocale) {
			return $this->select('name')
				->where('location_id', $location['id'])
				->where('language_id', $lang['id'])
				->get()
				->getRow('name');

SELECT *
FROM `location_translations`
WHERE `location_id` = '6'
AND `language_id` = '5'
 LIMIT 1
---
	public function updateTransName($location, $lang, $trans_name)
	{
		if ($lang['locale'] != config('App')->defaultLocale) {
			$existing = $this->where('location_id', $location['id'])
				->where('language_id', $lang['id'])
				->first();